Revit 2026 API

# RailingTypePrimaryHandrailLateralOffset Property

---

The lateral offset of the primary handrail.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double PrimaryHandrailLateralOffset { get; }
```
```vb
Public ReadOnly Property PrimaryHandrailLateralOffset As Double
	Get
```
```cpp
public:
property double PrimaryHandrailLateralOffset {
	double get ();
}
```
```fsharp
member PrimaryHandrailLateralOffset : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The rail has no primary hand rail. |

#### Reference

RailingType Class

Autodesk.Revit.DB.Architecture Namespace